#include <array>

namespace ZHTW {
	const std::array strings = {
		//Main Menu
		"刪除設定",
		"刪除補丁",
		"SaltyNX沒有執行！",
		"在sdcard內未檢查到NX-FPS外掛！",
		"遊戲未執行！",
		"全部遊戲",
		"所有遊戲",
		"遊戲列表",
		"螢幕設定",
		"遊戲已關閉！ FPSLocker已停用！",
		"遊戲未執行！ FPSLocker已停用！",
		"遊戲正在執行。",
		"NX-FPS未執行！",
		"NX-FPS正在執行，等待遊戲幀。",
		"重新進入FPSLocker來再次檢查。",
		"NX-FPS正在執行。",
		"補丁目前強制60Hz模式",
		"增大目標FPS",
		"減小目標FPS",
		"切換目標FPS",
		"停用自訂的目標FPS",
		"進階設定",
		"更新率分頻器:\n\uE019 0 (Unused)",
		"更新率分頻器:\n\uE019 %d (%.1f FPS)",
		"更新率分頻器:\n\uE019 %d (%d FPS)",
		"更新率分頻器:\n\uE019 %d (Wrong)",
		"自訂目標FPS:\n\uE019 未啟用",
		"自訂目標FPS:\n\uE019 %d",

		//Advanced Settings
		"設定幀緩衝",
		"設定將會在下次遊戲啟動時生效。",
		"雙重緩衝",
		"三重緩衝",
		"強制三重緩衝",
		"強制四重緩衝",
		"四重緩衝",
		"NVN垂直同步",
		"模式",
		"啟動",
		"半同步",
		"停用",
		"開",
		"關",
		"半同步",
		"無法找到設定檔\nTID：%016lX\nBID：%016lX",
		"設定檔錯誤：0x%X",
		"補丁不存在。\n請使用「轉換設定檔到補丁」\n來建立補丁！",
		"補丁不存在。",
		"新設定檔已下載。\n請使用「轉換設定檔到補丁」\n來使其生效！",
		"補丁已存在。",
		"圖形API：NVN",
		"垂直同步",
		"圖形API：EGL",
		"圖形API：Vulkan",
		"FPSLocker遊戲補丁",
		"找到有效的設定檔！",
		"請在轉換設定檔到補丁後重啟遊戲！",
		"轉換設定檔到補丁",
		"成功建立補丁。\n請重新啟動遊戲並修改\n目標FPS來套用補丁！",
		"建立補丁時發生錯誤：0x%x",
		"刪除補丁",
		"補丁已成功刪除。",
		"這可能需要最多30秒。",
		"檢查/下載設定檔",
		"正在從Warehouse內尋找設定檔…\n完成前將不能退出！",
		"雜項",
		"暫停後台遊戲",
		"遊戲補丁已載入。",
		"Master Write已載入。",
		"遊戲補丁未生效。",
		"Set/目前/可用 幀緩衝：%d/%d/%d",
		"目前幀緩衝：%d",
		"連接超時！",
		"設定檔不可用！ RC：0x%x",
		"設定檔不可用！\n正在檢查Warehouse…\n完成前將不能退出！",
		"設定檔不可用！\n正在檢查Warehouse…\n取得資料超時！",
		"設定檔不可用！\n正在檢查Warehouse…\n發生連接錯誤！",
		"沒有新設定檔可用。",
		"無可用網路連接！",
		"這個遊戲不需要補丁！",
		"Warehouse內未包含這個遊戲！",
		"Warehouse內包含遊戲的不同版本。\n%s 不需要補丁，\n你的版本也可能不需要！",
		"Warehouse內包含遊戲的不同版本。\n%s 需要使用補丁，\n但也沒有可用的設定檔！",
		"Warehouse內包含遊戲的不同版本。\n%s 有可用的設定檔！",
		"Warehouse內包含這個遊戲\n且這個版本的遊戲需要使用補丁，\n但沒有可用的設定檔！",
		"發生連接錯誤！ RC：0x%x",
		
		//Display Settings
		"跳幀測試器",

		"如何使用:\n"
		"1. 請找一個可以手動設定快門速度\n"
		"   和ISO(感光度)的照相機。\n"
		"2. 設定快門速度到1/10s或更長，\n"
		"   並且設定ISO使畫面亮度適中\n"
		"   (通常，1/10s快門和ISO50工作良好)。\n"
		"3. 按下 \uE0E0 來測試。\n"
		"4. 拍下顯示器的照片。\n"
		"5. 如果拍攝到的除第一個和最後一個\n"
		"   的所有塊，沒有均勻的亮起\n"
		"   則你的顯示器不原生支援目前更新率\n\n"
		"   在切換到其他更新率和FPS前請考慮\n"
		"   即使你的顯示器正在跳幀，\n"
		"   通常情況下，比起更低的平均FPS\n"
		"   執行在更高的更新率下，就視覺流暢度\n"
		"   仍為顯示器跳幀較好，因為內建的\n"
		"   硬體跳幀方案會輸出更均勻的幀時間",

		"按 \uE0E1 來退出",
		"幀繪製耗時太長！\n請到主螢幕重啟遊戲並重試。",
		
		"這個選單將會測試60Hz以下的更新率\n"
		"順序為40/45/50/55Hz。\n"
		"你需要在出現提示的15秒內按下手把上的對應按鍵\n" // or "你需要在出現提示的15秒內\n按下控制器上的對應按鍵\n"
		"來確認目前顯示器可以在測試中的更新率正常顯示。\n" // or "來確認目前使用的顯示器\n可以在測試中的更新率正常顯示。\n"
		"如果15秒內沒有輸入則會測試下一個更新率。",

		"請按下 X 鍵來開始。",
		"顯示器降頻助手",
		"在 %dp 解析度下不支援！",
		"請先關閉遊戲！",
		"請按下 ZL 來確認你的顯示器支援%dHz。",
		"請按下 X 來確認你的顯示器支援%dHz。",
		"請按下 Y 來確認你的顯示器支援%dHz。",
		"請按下 ZR 來確認你的顯示器支援%dHz。",

		"這個選單將會測試60Hz到%dHz的更新率。\n\n"
		"你需要在出現提示的10秒內按下手把上的對應按鍵\n" // or "你需要在出現提示的10秒內\n按下控制器上的對應按鍵\n"
		"來確認目前更新率可以在測試中的解析度正常顯示。\n" // or "來確認目前使用的更新率\n可以在測試中的解析度正常顯示。\n"
		"如果10秒內沒有輸入則會測試下一個更新率。\n"
		"這項測試最多會持續%d秒。",

		"顯示器超頻助手",
		"底座模式%dp顯示器手動設定",
		"底座模式顯示器更多設定",
		"允許補丁強制60Hz模式",
		"對於不匹配的目標FPS\n使用最低可用的更新率。",
		"n/d",
		"回報的最大可用更新率：%uHz\nmyDP鏈路速率：%s\n設定檔ID：%08X",
		"底座模式顯示器設定",

		"在%dp下允許使用的更新率",
		"%dp超頻助手",
		"更多設定",

		"現在沒有連接到底座。\n"
		"請將你的主機連接到底座後\n"
		"再試一次。",

		"變更更新率",
		"增大更新率",
		"減小更新率",
		"將更新率與目標FPS同步。",
		"掌機模式同步更新率",
		"底座模式設定",
		"Retro Remake模式",
		"目前顯示器更新率：%dHz",

		"警告：這是實驗性的功能！\n\n"
		"如果使用不當，這個功能可能\n"
		"對顯示器硬體造成永久性的傷害。\n\n"
		"如果按下「同意」，你知曉並同意:\n"
		"對於使用本工具中造成的任何問題，\n"
		"將由你承擔全部責任。",

		"顯示器進階設定警告",
		"拒絕",
		"同意",
		"強制使用英語作為顯示語言",
		"底座模式同步更新率",
		"僅掌機模式",
		"限制HOME選單到60Hz"
	};

	const std::array teslaStrings = {
	   "返回",
	   "確定"
	};

	static_assert(teslaStrings.size() == 2);

}
